{
    "title": "FAQ",
    "date": "2025-1-14",
    "author": "John Mathews",
    "content": "Okay, so it turns out that when I went home, everyone was really curious about the small deatails about living in Madrid. Totally understandable. So this post here is for frequently asked questions about auxing, madrid, prcies, travel, and anything else I can remember. \n\n         • How long are the flights from the United States to Spain? \n\n          - The flights I have taken are on American Air from Charlotte Douglas Intl Airport to Madrid-Barrajas Intl Airport in Madrid. The flight to Spain is seven hours while the flight back is 8 hours. \n\n         • What is the time difference between Madrid and Home? \n\n         - Madrid is six hours ahead (+6) of eastern standard time. \n\n          • Where do you live in Madird?\n\n          - I live in the \"Retiro District\" which ecompasses the streets to the east of Parque del buen Retiro. Inside of the Retiro Disrict, I live in the Ibiza barrio (very close to the Goya barrio). The barrio is very nice and has lots of older folks living there. It is definitely quieter than most of the places where the younger people live. \n\n          • Where are the coolest spots in the city? \n\n          - Puerta del Sol (Gate to the Sun) is the touristy spot, but it is still cool to visit. The barrios of Malasaña and Chueca have a lot of the bars young peole go to. Parque del Buen Retiro (the park I live next to) is a very famous and beautiful park right in the middle of the city. Think of it as central park. Other spots include: Parque de Casa de Campo, Opera/royal palace, Plaza de Espana, and the Reyna Sofia Museum.\n\n          • How much does it cost to live in Madrid?          - I will definitely say that the American salary goes far in Madrid. To use the transportation system (metro, bus, commuter rail, light rail), I pay 8 EUR/month (youth pass + government subsidy right now). My phone plan at Vodafone (which I really reccomend getting instead of buying TravelPass when visitng one country) is 20 EUR/month for 200 GB. Rent at my apartment is 600 EUR/month. Groceries depend on which stroe I go to. At Aldi two weeks of groceries are around 45 EUR while at El Corte Ingles it is 80 EUR for two weeks of groceries. \n\n         • What are the kids like? \n\n          - The kids at school are normal kids. They are good; however, the Pre-K kids can be a handful sometimes. \n\n          • Where is your school and what does your commute look like? \n\n          - My school is in the north west of Madrid. I take line 6 (circular line) to Guzman el Bueno station, then switch to line 7 (orange) to the Antonio Machado station. My school is a on minute walk off the metro. All together, it takes around 40 minutes to get to and from school if I get lucky with the trains. \n\n          • What is the food like? \n\n          - Okay so there are the four big foods in Spain: Spanish Tortilla, Croquetas, Iberian Ham, and Paella. I have tried three of the four and I love them all. Spanish Tortilla is like a small cake of eggs, potatoes, cheese, and onion (controversially). They sell it everyhwere in Madrid and it is wonderful (go to Pez Tortilla. Croquetas are small fried balls of ham, cheese, and pig fat. These are heavy and rich but still yummy (the best in the city are at \"Croquetas y Cocretas\" near my school!). Iberian Ham is found everywhere. The stores literally all sell huge legs of a pig for around 300 EUR. It is found in a lot of dishes, but bocadillos stand out to me. Personally, I have not tried paella. I am waiting to go to Valencia to try it. Another honorable mention are churros with chocolate. They are churros without sugar served with a coffee cup of melted chocolate to dip them in. This is my personal favorite as it is a nice breakfast food here!"
}