{
    "title": "¡Bienvenido a Madrid!",
    "date": "2024-12-17",
    "author": "John Mathews",
    "content": "\tI have always been curious of our world. Other countries thousands of miles away with different cultures, food, architecture, and way of life. Since high school, I knew I wanted to travel abroad. I knew that I did not want to miss out on my already shortened college expereince, so I began to save my money early. As I reasearched more into backpacking, I realized that the tourist visa for Europe (Schengen Area) is only for three months! This is turn lead me to the program I am currently in: NALCAP. It's an English assistant job sponsored bu the government of Spain. Luckily the government gave me a placement in the capital of Spain, Madrid. Once I received a place in the program at CEIP Eugenio Maria de Hostos, the government told me that I would teach primary and infantil education. My initial thought was that I would hate teaching pre-school children, but I definitly proved myself wrong (as I will detail later!). So with all that said, I'll start by describing my first two weeks in Europe. \n\n\tAfter a scary trip to Miami in a hurricane to get my passport with my new EU visa, I only had two days to say goodbye to the family and Abbie. It was hard for me to say \"good bye\" without tearing up in front of Abbie, but I just had to keep thinking of it more as \"see you soon :)\". Then I walked into the dreaded CLT airport. The airport was strangely more packed than I thought and the TSA Pre-Check line stretched further than I have ever seen it. I waited for probably thrity minutes before finally getting through TSA. Next, I exchanged some USD for EUR at a terrible rate (1 USD = .74 EUR) and headed off to the American Air lounge to chill before my flight. Once it was time to board, I went to terminal D (which needs desperate renovation) and got on the biggest plane I have ever been on. My mother got me a nice seat with some leg room and the strange version of Spanish was rampant all round me. Fortunately, I sat next to an abuela who talked my ear off the entire flight and gave me advice on: Madrid, Spain, history, learning spanish, girlfriends, and any else you can think of. I loved it. My first five minutes into the unknown and I already made a 65+ year old friend. After an in-flight meal and nine hours, the plane touched down in Madrid around four in the morning. \n\n\t I was officially on another continent for the first time. I said good bye to my new abuela and went to go find customs. This was my first struggle as all the signage was in Spanish and I got into the wrong line 3 times before a nice nun guided us lost Americans to the promised land. I walked past all the cool people that have EU passports and stood in the \"todos los passaportes\" line with all the other plebians. I talked to the nun for a while and found out she was heading to Toledo to join her sisters at the covenant. Additionally, she asked for computer help and I gave it my best to solve her problem without nerding out. Finally, I made it to the border officer and handed over my shiny EU Student Visa. He didn't say much and gave me the stamp and I was on my way. As I walked past the counter a random guy in front of me turned around and asked my about my sweatshirt (My green one that says \"Seek Discomfort.\" (It's a slogan from a YouTube channel that kind of inspired me to do this). His name is Diego and we introduced ourselves to each other and talked about what we are doing in Europe. We exchanged Instagrams as we did not have new SIM cards and from then on we were friends.  \n\n\tI had two goals my first day in Madrid: \n1. Get a SIM card \n2. Open a bank account\n\n\t So I set off through the awesome looking terminal until I ended up at the Metro. I hopped on the Metro and headed to a bank another aux (aux is the name my my job position) reccomended. I got off the Metro and got my first look at the city. The architecture is something American modern cities just do not have anymore and I wandered off mesmerized by all the sights. I finished my business at the bank and headed to the city center: Sol. They say that Sol is the center of the country and it definitly feels that way. Even at an early hour, the plaza was buzzing with people shopping, tours, and scammers already trying to take my money. I walked into the Vodafone store there to get my new eSIM card. I stumbled through talking to the employees and finally all my milestones were accomplished. Now I just needed a quick siesta at my hostel in a neighborhood called lavapies. Once I got there, the signs on the door said they did not allow early checkin or luggage holding. So I waited on a bench. After a while of waiting I decided to look into the reviews of the hostel and found out that it was not very good. So, I decided to upgrade to a boujee hostel in Puerta del Sol. I arrived to my new boujee hostel and asked if I could store my luggage until checkin and the nice lady just gave me my bed early! This hostel was very nice, a large community room and each dorm room and a private bath and lots of storage. I put my stuff away and fell right asleep until sunset. After sunset I walked around the first time to find food and water (the hardest thing to find). I dont remember what I ate, but I was really scared to order as my spanish knowledge is minimal. After dinner I fell asleep until the next day. \n\n I woke up really late and did not want to do much, as my first day of school was the next morning. Turns out this day would be not too boring. My new friend Diego called me and asked if I wanted some drinks with new friends he made and I obliged. I met Tristan and Caleb and we went and had dinner and drinks at 100 Montaditos (where jarras of cervezas are only 2 EUR!). Then, they suggested we go clubbing. Who am I to say \"no\"? So there I was in Shoko having a great time with new friends. I did leave early since I a grown and responsible adult I swear. \n\n\t My commute to school from Sol only took around thirty minutes by Metro. I get off at the \"Antonio Machado\" station and after that it is only a minute walk to my new job. I met my fellow auxs (Jeremy, Tori, and Alexandra) and we toured the school. We were then thrusted into out class schedule and that was it. Like I mentioned earlier, I was scared and maybe a litle dissapointed to teach infantil, but looking back I was wrong. The kids I teach are so sweet and it seems they genuinly enjoy seeing me everyday (but maybe they don't really enjoy learning Enlgish!). For the rest of the week, I explored the city and hung out with Diego and friends and went to the club a couple more times. Along the way Diego and I met a friend on the street named Rori, and she showed us around the city (including a really cool jazz club)\n\n\tDuring all of this, I had important things to do. Get a place to live and get my residency started ASAP. Everyday I was on Idealista and other websites trying to look for a place to live. Eventually, I got a lucky text from my now roomate, Garrett, that he needed to fill rooms in his apartment. I headed off to Ibiza to go and see the apartment. I did mistakenly go to the wrong apartment buliding, but eventually I made it. Garrett showed me around the 5 bed 2 bath apartment and I wanted to move in ASAP as he was chill and I was tired of looking for places. I asked him if I could live there (I didnt want to sound desperate but I did) and he said that I could. After a couple more days in the hostel, I moved in.",
    "imgurId": "EzNVyei"
}